Revit 2024 API
SystemsAnalysisOptions.OutputFolder Property
 The path of the output folder for systems analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public string OutputFolder { get; set; }
Visual Basic
Public Property OutputFolder As String
	Get
	Set
Visual C++
public:
property String^ OutputFolder {
	String^ get ();
	void set (String^ value);
}
Remarks
 When requesting a new system analysis, it is okay to have an empty output folder in the SystemsAnalysisOption. In that case, the ViewSystemsAnalysisReport would supply the output folder, typically at the system TEMP folder.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The analysis requires a valid output folder.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace